; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	thermograph2 - mode
	image0 - mode
	infrared3 - mode
	thermograph1 - mode
	GroundStation2 - direction
	GroundStation5 - direction
	GroundStation10 - direction
	GroundStation12 - direction
	GroundStation14 - direction
	Star15 - direction
	Star19 - direction
	Star24 - direction
	Star26 - direction
	GroundStation17 - direction
	Star29 - direction
	Star13 - direction
	Star4 - direction
	Star6 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	GroundStation11 - direction
	GroundStation21 - direction
	Star8 - direction
	GroundStation27 - direction
	Star7 - direction
	GroundStation9 - direction
	GroundStation20 - direction
	Star28 - direction
	GroundStation0 - direction
	GroundStation16 - direction
	Star23 - direction
	GroundStation22 - direction
	GroundStation25 - direction
	Star18 - direction
	Planet30 - direction
	Phenomenon31 - direction
	Phenomenon32 - direction
	Phenomenon33 - direction
	Phenomenon34 - direction
	Star35 - direction
	Star36 - direction
	Planet37 - direction
	Phenomenon38 - direction
	Phenomenon39 - direction
	Phenomenon40 - direction
	Planet41 - direction
	Star42 - direction
	Star43 - direction
	Planet44 - direction
	Phenomenon45 - direction
	Phenomenon46 - direction
	Phenomenon47 - direction
	Planet48 - direction
	Phenomenon49 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 thermograph1)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation25)
	(calibration_target instrument0 Star18)
	(calibration_target instrument0 GroundStation22)
	(calibration_target instrument0 Star29)
	(calibration_target instrument0 Star23)
	(calibration_target instrument0 GroundStation17)
	(calibration_target instrument0 Star28)
	(calibration_target instrument0 Star13)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 image0)
	(supports instrument1 thermograph1)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 Star13)
	(calibration_target instrument1 GroundStation27)
	(calibration_target instrument1 Star7)
	(calibration_target instrument1 GroundStation16)
	(calibration_target instrument1 GroundStation20)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument2 infrared3)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star23)
	(calibration_target instrument2 GroundStation27)
	(calibration_target instrument2 GroundStation16)
	(calibration_target instrument2 GroundStation11)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 Star28)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 Star6)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation21)
	(supports instrument4 image0)
	(supports instrument4 infrared3)
	(calibration_target instrument4 GroundStation25)
	(calibration_target instrument4 Star18)
	(calibration_target instrument4 GroundStation9)
	(calibration_target instrument4 Star7)
	(calibration_target instrument4 GroundStation20)
	(calibration_target instrument4 GroundStation27)
	(calibration_target instrument4 Star8)
	(supports instrument5 image0)
	(calibration_target instrument5 GroundStation22)
	(calibration_target instrument5 Star23)
	(calibration_target instrument5 GroundStation16)
	(calibration_target instrument5 GroundStation0)
	(calibration_target instrument5 Star28)
	(calibration_target instrument5 GroundStation20)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon39)
	(supports instrument6 image0)
	(supports instrument6 thermograph2)
	(supports instrument6 infrared3)
	(calibration_target instrument6 Star18)
	(calibration_target instrument6 GroundStation25)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon46)
)
(:goal (and
	(pointing satellite1 GroundStation12)
	(have_image Planet30 infrared3)
	(have_image Phenomenon31 infrared3)
	(have_image Phenomenon32 infrared3)
	(have_image Phenomenon33 infrared3)
	(have_image Phenomenon34 image0)
	(have_image Star35 infrared3)
	(have_image Star36 thermograph1)
	(have_image Planet37 thermograph2)
	(have_image Phenomenon38 image0)
	(have_image Phenomenon39 infrared3)
	(have_image Phenomenon40 thermograph1)
	(have_image Planet41 thermograph2)
	(have_image Star42 image0)
	(have_image Star43 infrared3)
	(have_image Planet44 thermograph2)
	(have_image Phenomenon45 thermograph2)
	(have_image Phenomenon46 thermograph2)
	(have_image Phenomenon47 thermograph1)
	(have_image Planet48 image0)
	(have_image Phenomenon49 thermograph2)
))

)

; plan
1. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 21
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 21
3. (turn_to satellite1 groundstation12 phenomenon39)
   deleted: (pointing satellite1 phenomenon39)
   added: (pointing satellite1 groundstation12)
   goals met: 1 of 21
4. (turn_to satellite0 phenomenon31 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon31)
   goals met: 1 of 21
5. (turn_to satellite2 phenomenon34 phenomenon46)
   deleted: (pointing satellite2 phenomenon46)
   added: (pointing satellite2 phenomenon34)
   goals met: 1 of 21
6. (turn_to satellite0 star29 phenomenon31)
   deleted: (pointing satellite0 phenomenon31)
   added: (pointing satellite0 star29)
   goals met: 1 of 21
7. (calibrate satellite0 instrument0 star29)
   added: (calibrated instrument0)
   goals met: 1 of 21
8. (turn_to satellite0 phenomenon31 star29)
   deleted: (pointing satellite0 star29)
   added: (pointing satellite0 phenomenon31)
   goals met: 1 of 21
9. (take_image satellite0 phenomenon31 instrument0 infrared3)
   added: (have_image phenomenon31 infrared3)
   goals met: 2 of 21
10. (turn_to satellite0 phenomenon32 phenomenon31)
   deleted: (pointing satellite0 phenomenon31)
   added: (pointing satellite0 phenomenon32)
   goals met: 2 of 21
11. (take_image satellite0 phenomenon32 instrument0 infrared3)
   added: (have_image phenomenon32 infrared3)
   goals met: 3 of 21
12. (turn_to satellite0 phenomenon33 phenomenon32)
   deleted: (pointing satellite0 phenomenon32)
   added: (pointing satellite0 phenomenon33)
   goals met: 3 of 21
13. (take_image satellite0 phenomenon33 instrument0 infrared3)
   added: (have_image phenomenon33 infrared3)
   goals met: 4 of 21
14. (turn_to satellite0 phenomenon39 phenomenon33)
   deleted: (pointing satellite0 phenomenon33)
   added: (pointing satellite0 phenomenon39)
   goals met: 4 of 21
15. (take_image satellite0 phenomenon39 instrument0 infrared3)
   added: (have_image phenomenon39 infrared3)
   goals met: 5 of 21
16. (turn_to satellite0 phenomenon40 phenomenon39)
   deleted: (pointing satellite0 phenomenon39)
   added: (pointing satellite0 phenomenon40)
   goals met: 5 of 21
17. (take_image satellite0 phenomenon40 instrument0 thermograph1)
   added: (have_image phenomenon40 thermograph1)
   goals met: 6 of 21
18. (turn_to satellite0 phenomenon45 phenomenon40)
   deleted: (pointing satellite0 phenomenon40)
   added: (pointing satellite0 phenomenon45)
   goals met: 6 of 21
19. (take_image satellite0 phenomenon45 instrument0 thermograph2)
   added: (have_image phenomenon45 thermograph2)
   goals met: 7 of 21
20. (turn_to satellite0 phenomenon46 phenomenon45)
   deleted: (pointing satellite0 phenomenon45)
   added: (pointing satellite0 phenomenon46)
   goals met: 7 of 21
21. (take_image satellite0 phenomenon46 instrument0 thermograph2)
   added: (have_image phenomenon46 thermograph2)
   goals met: 8 of 21
22. (turn_to satellite0 phenomenon47 phenomenon46)
   deleted: (pointing satellite0 phenomenon46)
   added: (pointing satellite0 phenomenon47)
   goals met: 8 of 21
23. (take_image satellite0 phenomenon47 instrument0 thermograph1)
   added: (have_image phenomenon47 thermograph1)
   goals met: 9 of 21
24. (turn_to satellite0 phenomenon49 phenomenon47)
   deleted: (pointing satellite0 phenomenon47)
   added: (pointing satellite0 phenomenon49)
   goals met: 9 of 21
25. (take_image satellite0 phenomenon49 instrument0 thermograph2)
   added: (have_image phenomenon49 thermograph2)
   goals met: 10 of 21
26. (turn_to satellite0 planet30 phenomenon49)
   deleted: (pointing satellite0 phenomenon49)
   added: (pointing satellite0 planet30)
   goals met: 10 of 21
27. (take_image satellite0 planet30 instrument0 infrared3)
   added: (have_image planet30 infrared3)
   goals met: 11 of 21
28. (turn_to satellite0 planet37 planet30)
   deleted: (pointing satellite0 planet30)
   added: (pointing satellite0 planet37)
   goals met: 11 of 21
29. (take_image satellite0 planet37 instrument0 thermograph2)
   added: (have_image planet37 thermograph2)
   goals met: 12 of 21
30. (turn_to satellite0 planet41 planet37)
   deleted: (pointing satellite0 planet37)
   added: (pointing satellite0 planet41)
   goals met: 12 of 21
31. (take_image satellite0 planet41 instrument0 thermograph2)
   added: (have_image planet41 thermograph2)
   goals met: 13 of 21
32. (turn_to satellite0 planet44 planet41)
   deleted: (pointing satellite0 planet41)
   added: (pointing satellite0 planet44)
   goals met: 13 of 21
33. (take_image satellite0 planet44 instrument0 thermograph2)
   added: (have_image planet44 thermograph2)
   goals met: 14 of 21
34. (turn_to satellite0 star35 planet44)
   deleted: (pointing satellite0 planet44)
   added: (pointing satellite0 star35)
   goals met: 14 of 21
35. (take_image satellite0 star35 instrument0 infrared3)
   added: (have_image star35 infrared3)
   goals met: 15 of 21
36. (turn_to satellite0 star36 star35)
   deleted: (pointing satellite0 star35)
   added: (pointing satellite0 star36)
   goals met: 15 of 21
37. (take_image satellite0 star36 instrument0 thermograph1)
   added: (have_image star36 thermograph1)
   goals met: 16 of 21
38. (turn_to satellite0 star43 star36)
   deleted: (pointing satellite0 star36)
   added: (pointing satellite0 star43)
   goals met: 16 of 21
39. (take_image satellite0 star43 instrument0 infrared3)
   added: (have_image star43 infrared3)
   goals met: 17 of 21
40. (turn_to satellite2 star18 phenomenon34)
   deleted: (pointing satellite2 phenomenon34)
   added: (pointing satellite2 star18)
   goals met: 17 of 21
41. (calibrate satellite2 instrument6 star18)
   added: (calibrated instrument6)
   goals met: 17 of 21
42. (turn_to satellite2 phenomenon34 star18)
   deleted: (pointing satellite2 star18)
   added: (pointing satellite2 phenomenon34)
   goals met: 17 of 21
43. (take_image satellite2 phenomenon34 instrument6 image0)
   added: (have_image phenomenon34 image0)
   goals met: 18 of 21
44. (turn_to satellite2 phenomenon38 phenomenon34)
   deleted: (pointing satellite2 phenomenon34)
   added: (pointing satellite2 phenomenon38)
   goals met: 18 of 21
45. (take_image satellite2 phenomenon38 instrument6 image0)
   added: (have_image phenomenon38 image0)
   goals met: 19 of 21
46. (turn_to satellite2 planet48 phenomenon38)
   deleted: (pointing satellite2 phenomenon38)
   added: (pointing satellite2 planet48)
   goals met: 19 of 21
47. (take_image satellite2 planet48 instrument6 image0)
   added: (have_image planet48 image0)
   goals met: 20 of 21
48. (turn_to satellite2 star42 planet48)
   deleted: (pointing satellite2 planet48)
   added: (pointing satellite2 star42)
   goals met: 20 of 21
49. (take_image satellite2 star42 instrument6 image0)
   added: (have_image star42 image0)
   goals met: 21 of 21
